6-runtime-view.md
```mermaid
sequenceDiagram

participant user as User
participant hub as Hub
participant db as HubDB
participant que as Service Bus
participant svc as Service
participant dm as Document Manager
participant fnt as Frontify

user ->> hub: 
rect rgb(240,240,240)
  note over user,fnt: Templates
hub ->> svc ++ #gold: Get Templates
svc ->> fnt ++ #gold: Get Templates
fnt -->> svc --
svc ->> fnt ++ #gold: Get Template Details
fnt -->> svc --
svc -->> hub --
end

hub ->> hub ++ #gold: Prepare Text and Images

hub ->> que  ++ #gold : Publish Brochure Artifacts 
hub -->> user --:done

    que ->> svc ++ #gold: Subscribe
loop
        svc ->> fnt ++ #gold: Load artifacts
        fnt -->> svc --
end
        svc ->> fnt ++ #gold : Generate Brochure
        fnt -->> svc -- : 
        svc ->> dm ++ #gold: Store
        dm -->> svc --: Saved
    svc ->> que --: Publish
hque ->> ub --++ #gold: Subscribe Brochure Metadata
hub ->> db : Add Brochure to attachments
hub -->> user --: Notify

note over user,fnt: 

user ->> hub ++ #gold
hub ->> dm ++ #gold: Access Brochure
dm -->> hub --: 
hub -->> user:

```
